<!DOCTYPE html>
<html lang="en">
<head>
        <meta charset="utf-8" />
        <meta name="viewport" content="width=device-width, initial-scale=1.0" />
        <meta name="generator" content="Pelican" />
        <title>C++虚继承对象内存布局</title>
        <link rel="stylesheet" href="/theme/css/main.css" />
        <meta name="description" content="1. 前言 2. GCC虚继承对象内存布局 2.1. 内存布局 2.2. 虚函数表 2.2.1. 虚函数指针 2.2.2. Type Info指针 2.2.3. Top Offset 2.2.4. VBase Offset 2.2.5. VCall Offset 2.3 …" />

        <style>
          /* #content { max-width: 60em; margin: auto; } */
          .title  { text-align: center;
                     margin-bottom: .2em; }
          .subtitle { text-align: center;
                      font-size: medium;
                      font-weight: bold;
                      margin-top:0; }
          .todo   { font-family: monospace; color: red; }
          .done   { font-family: monospace; color: green; }
          .priority { font-family: monospace; color: orange; }
          .tag    { background-color: #eee; font-family: monospace;
                    padding: 2px; font-size: 80%; font-weight: normal; }
          .timestamp { color: #bebebe; }
          .timestamp-kwd { color: #5f9ea0; }
          .org-right  { margin-left: auto; margin-right: 0px;  text-align: right; }
          .org-left   { margin-left: 0px;  margin-right: auto; text-align: left; }
          .org-center { margin-left: auto; margin-right: auto; text-align: center; }

    <span style="font-weight: bold; text-decoration: underline;">B1</span> <span style="font-weight: bold; font-style: italic;">b1</span>;
    <span style="font-weight: bold; text-decoration: underline;">B2</span> <span style="font-weight: bold; font-style: italic;">b2</span>;
    <span style="font-weight: bold; text-decoration: underline;">C</span> <span style="font-weight: bold; font-style: italic;">c</span>;

    <span style="font-weight: bold; text-decoration: underline;">B2</span> *<span style="font-weight: bold; font-style: italic;">pb2</span> = &amp;c;
    pb2-&gt;f(); <span style="font-weight: bold; font-style: italic;">// </span><span style="font-weight: bold; font-style: italic;">non-virtual thunk</span>
    pb2-&gt;a = 0; <span style="font-weight: bold; font-style: italic;">// </span><span style="font-weight: bold; font-style: italic;">vbase_offset</span>

    <span style="font-weight: bold; text-decoration: underline;">A</span> *<span style="font-weight: bold; font-style: italic;">pa</span> = &amp;c;
    pa-&gt;f();  <span style="font-weight: bold; font-style: italic;">// </span><span style="font-weight: bold; font-style: italic;">virtual thunk, vcall_offset</span>

    <span style="font-weight: bold; text-decoration: underline;">C</span> *<span style="font-weight: bold; font-style: italic;">pc</span> = <span style="font-weight: bold;">dynamic_cast</span>&lt;<span style="font-weight: bold; text-decoration: underline;">C</span> *&gt;(pa);  <span style="font-weight: bold; font-style: italic;">// </span><span style="font-weight: bold; font-style: italic;">dynamic_cast</span>
    <span style="font-weight: bold;">const</span> <span style="font-weight: bold; text-decoration: underline;">std</span>::<span style="font-weight: bold; text-decoration: underline;">type_info</span> &amp;<span style="font-weight: bold; font-style: italic;">ti</span> = <span style="font-weight: bold;">typeid</span>(*pa);  <span style="font-weight: bold; font-style: italic;">// </span><span style="font-weight: bold; font-style: italic;">typeid</span>

    <span style="font-weight: bold; text-decoration: underline;">void</span> *<span style="font-weight: bold; font-style: italic;">pvoid</span> = <span style="font-weight: bold;">dynamic_cast</span>&lt;<span style="font-weight: bold; text-decoration: underline;">void</span> *&gt;(pa);  <span style="font-weight: bold; font-style: italic;">// </span><span style="font-weight: bold; font-style: italic;">top offset</span>

    <span style="font-weight: bold;">return</span> 0;
}
</pre>
</div>
</div>
<div id="outline-container-org97491e8" class="outline-3">
<h3 id="org97491e8"><span class="section-number-3">2.1.</span> 内存布局</h3>
<div class="outline-text-3" id="text-2-1">
<p>
子类内存可以被分为两部分，第一部分存储多个父类对应的subobject，第二部分则存储子类自己的数据成员。
子类内存中必须包含所有父类完整的subobject，否则子类指针将无法被向上转型为父类指针（指向子类对象相应subobject的父类指针将出现数据成员内存访问问题）。
</p>

<p>
当具有虚函数时，对象内存的第一块为vptr（vtable指针）。
比如，A的对象内存布局如下：
</p>
<pre class="example" id="org21a16ab">
0 | struct A
0 |   (A vtable pointer)
8 |   long a
  | [sizeof=16, dsize=16, align=8,
  |  nvsize=16, nvalign=8]
</pre>

<p>
对于虚继承，虚基类subobject位于对象内存最后（普通继承基类的subobject位于对象内存最前面）。
比如：
</p>
<ol class="org-ol">
<li><p>
B1的对象内存布局如下：
</p>
<pre class="example" id="orgba7398e">
 0 | struct B1
 0 |   (B1 vtable pointer)
 8 |   long b1
16 |   struct A (virtual base)
16 |     (A vtable pointer)
24 |     long a
   | [sizeof=32, dsize=32, align=8,
   |  nvsize=16, nvalign=8]
</pre></li>
<li><p>
C的对象内存布局如下：
</p>
<pre class="example" id="orge8aa13b">
 0 | struct C
 0 |   struct B1 (primary base)
 0 |     (B1 vtable pointer)
 8 |     long b1
16 |   struct B2 (base)
16 |     (B2 vtable pointer)
24 |     long b2
32 |   long c
40 |   struct A (virtual base)
40 |     (A vtable pointer)
48 |     long a
   | [sizeof=56, dsize=56, align=8,
   |  nvsize=40, nvalign=8]
</pre></li>
</ol>
</div>
</div>
<div id="outline-container-orgf298c8c" class="outline-3">
<h3 id="orgf298c8c"><span class="section-number-3">2.2.</span> 虚函数表</h3>
<div class="outline-text-3" id="text-2-2">
<p>
C++子类的虚函数表内容源自扩增和修改后的父类虚函数表内容的集合。
子类vtable必须包含完整的父类vtable，否则指向子类对象的父类指针将无法正确使用虚函数。
</p>

<p>
C的虚函数表的内容比A/B1/B2丰富不少，因此本文将主要分析C的虚函数表。
C的虚函数表内容如下：
</p>
<pre class="example" id="orga1599e4">
C::_ZTV1C: 24 entries
################################### B1 &amp;&amp; C ####################################
0     40                                   # 40
8     (int (*)(...))0                      # 0
16    (int (*)(...))(&amp; _ZTI1C)             # typeinfo for C
24    (int (*)(...))C::f                   # C::f() const
32    (int (*)(...))C::fB1                 # C::fB1() const
40    (int (*)(...))C::~C                  # C::~C() [complete object destructor]
